---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ConnectionValidationInfo Properties
ConnectionValidationInfo Class See Also Send Feedback
---

The ConnectionValidationInfo type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ConnectionValidationInfo Class

Autodesk.Revit.DB Namespace